<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"e2c1eb596902bc8775b280344913cefa229cbc8089bcfd2fdc0cd5c8c5f9fa91","plan_job_ref":"Job Plan Airflow DAGs #360 at https://github.com/cal-itp/data-infra/actions/runs/16382500368","plan_out_hash":"b7be00aba62fa9ea31a4626bb95a78329ccd57725728269de3464f8bbae494f2","plan_hash":"9e08243044844110d13efbb3404ccafa4d0a519bd8c8326e9b33d6385b3ef0b4","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 8 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "XmWZkA==" -> (known after apply)
!~      detect_md5hash      = "jABgKMAYxVm+czmukHiiKw==" -> "different hash"
!~      generation          = 1752855618467062 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "jABgKMAYxVm+czmukHiiKw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/intermediate/gtfs_quality/guidelines_checks/int_gtfs_quality__wheelchair_accessible_trips.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "WR6pEA==" -> (known after apply)
!~      detect_md5hash      = "nJ9xB2ozWMaR6xs1DeRLIA==" -> "different hash"
!~      generation          = 1750182580701458 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/intermediate/gtfs_quality/guidelines_checks/int_gtfs_quality__wheelchair_accessible_trips.sql"
!~      md5hash             = "nJ9xB2ozWMaR6xs1DeRLIA==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/gtfs_quality/guidelines_checks/int_gtfs_quality__wheelchair_accessible_trips.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/intermediate/gtfs_quality/guidelines_checks/int_gtfs_quality__wheelchair_boarding_stops.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "W4SD3A==" -> (known after apply)
!~      detect_md5hash      = "gu3rnxIpcFsHvV/Lr2S6QA==" -> "different hash"
!~      generation          = 1750182580522013 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/intermediate/gtfs_quality/guidelines_checks/int_gtfs_quality__wheelchair_boarding_stops.sql"
!~      md5hash             = "gu3rnxIpcFsHvV/Lr2S6QA==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/gtfs_quality/guidelines_checks/int_gtfs_quality__wheelchair_boarding_stops.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/intermediate/gtfs_quality/int_gtfs_quality__guideline_checks_index.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "RmHaXA==" -> (known after apply)
!~      detect_md5hash      = "cov8NZ39r3bN24BNoIowSg==" -> "different hash"
!~      generation          = 1749663118061377 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/intermediate/gtfs_quality/int_gtfs_quality__guideline_checks_index.sql"
!~      md5hash             = "cov8NZ39r3bN24BNoIowSg==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/gtfs_quality/int_gtfs_quality__guideline_checks_index.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/intermediate/gtfs_quality/int_gtfs_quality__guideline_checks_long.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "Vnalzg==" -> (known after apply)
!~      detect_md5hash      = "+NXlwO3+8vkrZP7xgcLEMA==" -> "different hash"
!~      generation          = 1750182580523592 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/intermediate/gtfs_quality/int_gtfs_quality__guideline_checks_long.sql"
!~      md5hash             = "+NXlwO3+8vkrZP7xgcLEMA==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/gtfs_quality/int_gtfs_quality__guideline_checks_long.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs_quality/fct_daily_organization_combined_guideline_checks.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "uEJ7aQ==" -> (known after apply)
!~      detect_md5hash      = "XjTXI/ExBt3IaIBD0R/8Pg==" -> "different hash"
!~      generation          = 1749663120429115 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/gtfs_quality/fct_daily_organization_combined_guideline_checks.sql"
!~      md5hash             = "XjTXI/ExBt3IaIBD0R/8Pg==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs_quality/fct_daily_organization_combined_guideline_checks.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs_quality/fct_monthly_reports_site_organization_guideline_checks.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "X5fZ0g==" -> (known after apply)
!~      detect_md5hash      = "V7gP6ICByPI1+OiWhDggdw==" -> "different hash"
!~      generation          = 1749663119282835 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/gtfs_quality/fct_monthly_reports_site_organization_guideline_checks.sql"
!~      md5hash             = "V7gP6ICByPI1+OiWhDggdw==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs_quality/fct_monthly_reports_site_organization_guideline_checks.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "24GPXw==" -> (known after apply)
!~      detect_md5hash      = "R11VD+ssi9yD0q3zetVRwg==" -> "different hash"
!~      generation          = 1752855620512942 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "R11VD+ssi9yD0q3zetVRwg==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 8 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #360](https://github.com/cal-itp/data-infra/actions/runs/16382500368)